# MySQL connection with python (Data inserter)
PostgreSQL, also known as Postgres, is a free and open-source relational database management system emphasizing extensibility and SQL compliance. It was originally named POSTGRES, referring to its origins as a successor to the Ingres database developed at the University of California, Berkeley.

In [27]:
#!/usr/bin/python

try:
    import mysql.connector as mysql
    import pandas as pd
    import pandas.io.sql as psql
    import numpy as np
    from matplotlib import pyplot as plt
    from IPython.display import display
    import os
    #import pandas_profiling as pp
    
    
    
    host="127.0.0.1"
    database="lms2"
    user="root"
    password=""
    conn= mysql.connect(
        host=host,
        user=user,
        password=password,
        database=database)


    print ("Opened database successfully")

except Exception as e:
    print(e)

Opened database successfully

## Here we can make sure that the all rows and columns are displayed.

In [28]:
pd.options.display.max_rows = None
pd.options.display.max_columns = None

## Only use this in order to create tables

In [36]:
cur = conn.cursor()
cur.execute("""
    
    CREATE TABLE Sample_Geom(
    zip INTEGER(3) NOT NULL PRIMARY KEY, 
    latitude NUMERIC(9,6), 
    longitude NUMERIC(10,6),
    city VARCHAR(10),
    state VARCHAR(2),
    county VARCHAR(9)
    );
    

""")

conn.commit() 
print ("Table created successfully!!!")

ProgrammingError: 1050 (42S01): Table 'sample_geom' already exists

## Only use this in order to create spatial tables

In [20]:
"""
cur = conn.cursor()
cur.execute('''


CREATE TABLE address (
  address CHAR(80) NOT NULL,
  address_loc POINT NOT NULL,
  PRIMARY KEY(address),
  SPATIAL KEY(address_loc)
);
      
      
      
''')

conn.commit() # <--- makes sure the change is shown in the database
print ("Table created successfully!!!")


"""

'\ncur = conn.cursor()\ncur.execute(\'\'\'\n\n\nCREATE TABLE address (\n  address CHAR(80) NOT NULL,\n  address_loc POINT NOT NULL,\n  PRIMARY KEY(address),\n  SPATIAL KEY(address_loc)\n);\n      \n      \n      \n\'\'\')\n\nconn.commit() # <--- makes sure the change is shown in the database\nprint ("Table created successfully!!!")\n\n\n'

In [38]:
###use this query to create tables

zip =  input("Enter Zip: ")
latitude=input("Enter latitude: ")
longitude= input("Enter longitude: ")
city= input("Enter city: ")
state= input("Enter state: ")
county= input("Enter county: ")
    


cur = conn.cursor()
cur.execute(f"""
insert into Sample_Geom (
   zip, latitude,longitude,city,state,county) 
   values('{zip}', '{latitude}', '{longitude}', '{city}', '{state}','{county}');
      


""")


   
      
      


conn.commit() # <--- makes sure the change is shown in the database
print ("Values have been entered sucessfully!!!")

Enter Zip: 501
Enter latitude: 40.922326
Enter longitude: -72.637078
Enter city: Holtsville
Enter state: NY
Enter county: Suffolk
Values have been entered sucessfully!!!

### Enter data into the table that was created

In [23]:
###use this query to create tables
First_Name = input("Enter First name: ")
Last_Name = input("Enter Lastname: ")
Age = input("Enter age: ")
Place_Of_Birth = input("Enter Place of Birth: ")
Country = input("Enter Country: ")

cur = conn.cursor()
cur.execute(f'''

insert into CRICKETERS (
   First_Name, Last_Name, Age, Place_Of_Birth, Country) 
   values('{First_Name}', '{Last_Name}', {Age}, '{Place_Of_Birth }', '{Country}');
      
   
      
      
''')

conn.commit() # <--- makes sure the change is shown in the database
print ("Values have been entered sucessfully!!!")

Enter First name: Stephanie
Enter Lastname: Rodriguez
Enter age: 30
Enter Place of Birth: USA
Enter Country: USA
Values have been entered sucessfully!!!

## Run queries

In [22]:
query = """

select * 
from cricketers

"""

data = psql.read_sql(query, conn)
data

  First_Name  Last_Name  Age      Place_Of_Birth             Country
0       Joel  Rodriguez   34  Dominican Republic       United States
1     Moises  Rodriguez   25  Dominican Republic  Dominican Republic
2      Glenn  Greenwald   50       United States              Brazil
3       Nick     Rundee   20                 USA                 USA
4     Edward    Snowden   35                 USA              Russia

### Description of the data.
This only applies to numeric values

In [11]:
data.describe()

             Age
count   2.000000
mean   29.500000
std     6.363961
min    25.000000
25%    27.250000
50%    29.500000
75%    31.750000
max    34.000000

### Convert your results into a Json file

In [12]:
### table, records,split,index,columns,values
print(data.to_json(orient ='table'))

{"schema":{"fields":[{"name":"index","type":"integer"},{"name":"First_Name","type":"string"},{"name":"Last_Name","type":"string"},{"name":"Age","type":"integer"},{"name":"Place_Of_Birth","type":"string"},{"name":"Country","type":"string"}],"primaryKey":["index"],"pandas_version":"0.20.0"},"data":[{"index":0,"First_Name":"Joel","Last_Name":"Rodriguez","Age":34,"Place_Of_Birth":"Dominican Republic","Country":"United States"},{"index":1,"First_Name":"Moises","Last_Name":"Rodriguez","Age":25,"Place_Of_Birth":"Dominican Republic","Country":"Dominican Republic"}]}

## Prepare an extensive profile of your data

In [ ]:
#profile = pp.ProfileReport(data)
#profile.to_file("output1.html")
#profile = pp.ProfileReport(data)
#profile.to_file("output1.html")

# Make sure you close your connection.
If we don't close the connection, it will lead to connection memory leakage. Unless/until application server/web server is shut down, connection will remain activate even though the user logs out.

There are additional reasons. Suppose database server has 10 connections available and 10 clients request for the connection. If the database sever grants all of them, and after their usage they are not closed, the database server would not be able to provide a connections for another request. For that reason we need to close them - it is mandatory.

Furthermore, it might lead to some mischievous activities regarding the integrity of the database. https://stackoverflow.com/questions/25864235/why-we-should-close-the-connection-in-jdbc-if-we-dont-do-it-what-will-happen

In [21]:
try:
    conn.commit()
    conn.close()
    print("connection has been closed!!")
except: 
    print("connection already closed")

connection has been closed!!